# CannotPasteModelPlusViewSpecificElementsIntoView Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..CannotPasteModelPlusViewSpecificElementsIntoView Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
Cannot paste view-specific model plus into view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotPasteModelPlusViewSpecificElementsIntoView { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotPasteModelPlusViewSpecificElementsIntoView As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotPasteModelPlusViewSpecificElementsIntoView {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace